Updating Rows and Columns - Modifying Data Within DataFrames

In [47]:
import pandas as pd
people={
    "First" :["Siddhant","Rupaniwta","Karan"],
    "Last" :["Roy","Sahani","Yadav"],
    "Email":["siddhantroy@gmail.com","rupaniwtasahani@gmail.com","karanyadaav@gmail.com"]
}
df=pd.DataFrame(people)
df

       First    Last                      Email
0   Siddhant     Roy      siddhantroy@gmail.com
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com
2      Karan   Yadav      karanyadaav@gmail.com

In [2]:
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

In [48]:
df.columns = ["First_Name","Last_Name","Email"]

In [28]:
df

  First_Name Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1  Rupaniwta    Sahani  rupaniwtasahani@gmail.com
2      Karan     Yadav      karanyadaav@gmail.com

In [29]:
#Made all the column name in uppercase
df.columns=[x.upper() for x in df.columns]

In [43]:
df

  First_Name Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1  Rupaniwta    Sahani  rupaniwtasahani@gmail.com
2      Karan     Yadav      karanyadaav@gmail.com

RENAMING A COLUMN NAME:

In [44]:
#Have to write inplace=True or else it would not make changes to the main dataframe.
df.rename(columns={'First_Name':"first"},inplace=True)
df

       first Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1  Rupaniwta    Sahani  rupaniwtasahani@gmail.com
2      Karan     Yadav      karanyadaav@gmail.com

UPDATING ROW VALUES:

In [49]:
df.loc[2]=["Simran","Roy","simranroy@gmail.com"]
df

  First_Name Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1  Rupaniwta    Sahani  rupaniwtasahani@gmail.com
2     Simran       Roy        simranroy@gmail.com

UPDATING SPECIFIC ROW VALUES WITH SPECIFIC COLUMNS

In [50]:
#We chaged second row values for column first and last
df.loc[1, ["First_Name","Last_Name"]]=["Motu","Roy"]
df

  First_Name Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1       Motu       Roy  rupaniwtasahani@gmail.com
2     Simran       Roy        simranroy@gmail.com

In [51]:
df.loc[2,"Last_Name"] = "Yadav"
df

  First_Name Last_Name                      Email
0   Siddhant       Roy      siddhantroy@gmail.com
1       Motu       Roy  rupaniwtasahani@gmail.com
2     Simran     Yadav        simranroy@gmail.com

USING A FILTER TO FIND A SPECIFIC ROW AND CHANGE IT'S VALUES:

In [62]:
filt=df["Email"]=="siddhantroy@gmail.com"
df.loc[filt,"Last_Name"] = "Sahani"

In [63]:
df

  First_Name Last_Name                      Email
0   Siddhant    Sahani      siddhantroy@gmail.com
1       Motu       Roy  rupaniwtasahani@gmail.com
2     Simran     Yadav        simranroy@gmail.com